{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "top" : "35",
      "w" : 12,
      "h" : 1,
      "name" : "35",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "35",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 1
    },
    {
      "bottom" : "x_1,35",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.1",
      "top" : "input.1",
      "type" : "elementwise",
      "name" : "input.1",
      "beta" : 0
    },
    {
      "nB" : 12,
      "top" : "x.3",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 16,
      "blob_weights" : 5,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.1",
      "blob_biases" : 3,
      "has_tanh" : 0,
      "debug_info" : "x.3",
      "name" : "x.3",
      "has_prelu" : 0
    },
    {
      "bottom" : "x.3",
      "end" : 8,
      "start" : 0,
      "weights" : {

      },
      "axis" : 0,
      "debug_info" : "x.5",
      "top" : "x.5",
      "type" : "slice",
      "name" : "x.5"
    },
    {
      "bottom" : "x.3",
      "end" : 16,
      "start" : 8,
      "weights" : {

      },
      "axis" : 0,
      "debug_info" : "x",
      "top" : "x",
      "type" : "slice",
      "name" : "x"
    },
    {
      "top" : "67",
      "w" : 8,
      "h" : 1,
      "name" : "67",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "67",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 7
    },
    {
      "alpha" : -1,
      "bottom" : "67",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "_neg_y_78",
      "top" : "_neg_y_78",
      "type" : "activation",
      "name" : "_neg_y_78",
      "beta" : 0
    },
    {
      "bottom" : "_neg_y_78,x.5",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "78",
      "top" : "78",
      "type" : "elementwise",
      "name" : "78",
      "beta" : 0
    },
    {
      "top" : "75",
      "w" : 8,
      "h" : 1,
      "name" : "75",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "75",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 9
    },
    {
      "bottom" : "75,78",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.3",
      "top" : "input.3",
      "type" : "elementwise",
      "name" : "input.3",
      "beta" : 0
    },
    {
      "nB" : 8,
      "top" : "input.5",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 13,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.3",
      "blob_biases" : 11,
      "has_tanh" : 0,
      "debug_info" : "input.5",
      "name" : "input.5",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.5",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "input.7",
      "top" : "input.7",
      "type" : "activation",
      "name" : "input.7"
    },
    {
      "nB" : 6,
      "top" : "input.9",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 17,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.7",
      "blob_biases" : 15,
      "has_tanh" : 0,
      "debug_info" : "input.9",
      "name" : "input.9",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.9",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "input.11",
      "top" : "input.11",
      "type" : "activation",
      "name" : "input.11"
    },
    {
      "nB" : 6,
      "top" : "input.13",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 21,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.11",
      "blob_biases" : 19,
      "has_tanh" : 0,
      "debug_info" : "input.13",
      "name" : "input.13",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.13",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "input.15",
      "top" : "input.15",
      "type" : "activation",
      "name" : "input.15"
    },
    {
      "nB" : 6,
      "top" : "input.17",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 25,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.15",
      "blob_biases" : 23,
      "has_tanh" : 0,
      "debug_info" : "input.17",
      "name" : "input.17",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.17",
      "weights" : {

      },
      "nd_axis" : 1,
      "debug_info" : "x11",
      "top" : "x11",
      "type" : "softmax_nd",
      "name" : "x11"
    },
    {
      "top" : "104",
      "w" : 8,
      "h" : 1,
      "name" : "104",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "104",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 27
    },
    {
      "alpha" : -1,
      "bottom" : "104",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "_neg_y_115",
      "top" : "_neg_y_115",
      "type" : "activation",
      "name" : "_neg_y_115",
      "beta" : 0
    },
    {
      "bottom" : "_neg_y_115,x.5",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "115",
      "top" : "115",
      "type" : "elementwise",
      "name" : "115",
      "beta" : 0
    },
    {
      "top" : "112",
      "w" : 8,
      "h" : 1,
      "name" : "112",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "112",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 29
    },
    {
      "bottom" : "112,115",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.19",
      "top" : "input.19",
      "type" : "elementwise",
      "name" : "input.19",
      "beta" : 0
    },
    {
      "nB" : 8,
      "top" : "input.21",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 33,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.19",
      "blob_biases" : 31,
      "has_tanh" : 0,
      "debug_info" : "input.21",
      "name" : "input.21",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.21",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "input.23",
      "top" : "input.23",
      "type" : "activation",
      "name" : "input.23"
    },
    {
      "nB" : 6,
      "top" : "input.25",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 37,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.23",
      "blob_biases" : 35,
      "has_tanh" : 0,
      "debug_info" : "input.25",
      "name" : "input.25",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.25",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "input.27",
      "top" : "input.27",
      "type" : "activation",
      "name" : "input.27"
    },
    {
      "nB" : 6,
      "top" : "input.29",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 41,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.27",
      "blob_biases" : 39,
      "has_tanh" : 0,
      "debug_info" : "input.29",
      "name" : "input.29",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.29",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "input.31",
      "top" : "input.31",
      "type" : "activation",
      "name" : "input.31"
    },
    {
      "nB" : 6,
      "top" : "input.33",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 45,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.31",
      "blob_biases" : 43,
      "has_tanh" : 0,
      "debug_info" : "input.33",
      "name" : "input.33",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.33",
      "weights" : {

      },
      "nd_axis" : 1,
      "debug_info" : "x12",
      "top" : "x12",
      "type" : "softmax_nd",
      "name" : "x12"
    },
    {
      "bottom" : "x11,x12",
      "weights" : {

      },
      "nd_mode" : true,
      "axis" : 1,
      "debug_info" : "input.35",
      "top" : "input.35",
      "type" : "general_concat",
      "name" : "input.35"
    },
    {
      "nB" : 4,
      "top" : "partial_EP_scores",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 1,
      "blob_weights" : 49,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.35",
      "blob_biases" : 47,
      "has_tanh" : 0,
      "debug_info" : "partial_EP_scores",
      "name" : "partial_EP_scores",
      "has_prelu" : 0
    },
    {
      "top" : "147",
      "w" : 8,
      "h" : 1,
      "name" : "147",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "147",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 51
    },
    {
      "alpha" : -1,
      "bottom" : "147",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "_neg_y_158",
      "top" : "_neg_y_158",
      "type" : "activation",
      "name" : "_neg_y_158",
      "beta" : 0
    },
    {
      "bottom" : "_neg_y_158,x",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "158",
      "top" : "158",
      "type" : "elementwise",
      "name" : "158",
      "beta" : 0
    },
    {
      "top" : "155",
      "w" : 8,
      "h" : 1,
      "name" : "155",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "155",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 53
    },
    {
      "bottom" : "155,158",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.37",
      "top" : "input.37",
      "type" : "elementwise",
      "name" : "input.37",
      "beta" : 0
    },
    {
      "nB" : 8,
      "top" : "input.39",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 57,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.37",
      "blob_biases" : 55,
      "has_tanh" : 0,
      "debug_info" : "input.39",
      "name" : "input.39",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.39",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "input.41",
      "top" : "input.41",
      "type" : "activation",
      "name" : "input.41"
    },
    {
      "nB" : 6,
      "top" : "input.43",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 61,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.41",
      "blob_biases" : 59,
      "has_tanh" : 0,
      "debug_info" : "input.43",
      "name" : "input.43",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.43",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "input.45",
      "top" : "input.45",
      "type" : "activation",
      "name" : "input.45"
    },
    {
      "nB" : 6,
      "top" : "input.47",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 65,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.45",
      "blob_biases" : 63,
      "has_tanh" : 0,
      "debug_info" : "input.47",
      "name" : "input.47",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.47",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "input.49",
      "top" : "input.49",
      "type" : "activation",
      "name" : "input.49"
    },
    {
      "nB" : 6,
      "top" : "input.51",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 69,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.49",
      "blob_biases" : 67,
      "has_tanh" : 0,
      "debug_info" : "input.51",
      "name" : "input.51",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.51",
      "weights" : {

      },
      "nd_axis" : 1,
      "debug_info" : "x21",
      "top" : "x21",
      "type" : "softmax_nd",
      "name" : "x21"
    },
    {
      "top" : "184",
      "w" : 8,
      "h" : 1,
      "name" : "184",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "184",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 71
    },
    {
      "alpha" : -1,
      "bottom" : "184",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "_neg_y_195",
      "top" : "_neg_y_195",
      "type" : "activation",
      "name" : "_neg_y_195",
      "beta" : 0
    },
    {
      "bottom" : "_neg_y_195,x",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "195",
      "top" : "195",
      "type" : "elementwise",
      "name" : "195",
      "beta" : 0
    },
    {
      "top" : "192",
      "w" : 8,
      "h" : 1,
      "name" : "192",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "192",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 73
    },
    {
      "bottom" : "192,195",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.53",
      "top" : "input.53",
      "type" : "elementwise",
      "name" : "input.53",
      "beta" : 0
    },
    {
      "nB" : 8,
      "top" : "input.55",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 77,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.53",
      "blob_biases" : 75,
      "has_tanh" : 0,
      "debug_info" : "input.55",
      "name" : "input.55",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.55",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "input.57",
      "top" : "input.57",
      "type" : "activation",
      "name" : "input.57"
    },
    {
      "nB" : 6,
      "top" : "input.59",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 81,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.57",
      "blob_biases" : 79,
      "has_tanh" : 0,
      "debug_info" : "input.59",
      "name" : "input.59",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.59",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "input.61",
      "top" : "input.61",
      "type" : "activation",
      "name" : "input.61"
    },
    {
      "nB" : 6,
      "top" : "input.63",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 85,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.61",
      "blob_biases" : 83,
      "has_tanh" : 0,
      "debug_info" : "input.63",
      "name" : "input.63",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.63",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "input.65",
      "top" : "input.65",
      "type" : "activation",
      "name" : "input.65"
    },
    {
      "nB" : 6,
      "top" : "input.67",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 89,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.65",
      "blob_biases" : 87,
      "has_tanh" : 0,
      "debug_info" : "input.67",
      "name" : "input.67",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.67",
      "weights" : {

      },
      "nd_axis" : 1,
      "debug_info" : "x22",
      "top" : "x22",
      "type" : "softmax_nd",
      "name" : "x22"
    },
    {
      "bottom" : "x21,x22",
      "weights" : {

      },
      "nd_mode" : true,
      "axis" : 1,
      "debug_info" : "input",
      "top" : "input",
      "type" : "general_concat",
      "name" : "input"
    },
    {
      "nB" : 4,
      "top" : "eager_EP_scores",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 1,
      "blob_weights" : 93,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input",
      "blob_biases" : 91,
      "has_tanh" : 0,
      "debug_info" : "eager_EP_scores",
      "name" : "eager_EP_scores",
      "has_prelu" : 0
    },
    {
      "bottom" : "partial_EP_scores,eager_EP_scores",
      "weights" : {

      },
      "nd_mode" : true,
      "debug_info" : "223",
      "axis" : 1,
      "top" : "var_127",
      "type" : "general_concat",
      "name" : "223",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}