program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.16.0"}, {"coremlc-version", "1649.0.0"}})]
{
    func main<ios17>(tensor<fp32, [1, 29, 80]> feat, tensor<fp32, [2, 128, 8, 64]> ph_att_key_cache_in, tensor<fp32, [2, 64, 8, 128]> ph_att_value_cache_in, tensor<fp32, [2, 512, 1, 7]> ph_cnn_cache_in, tensor<fp32, [1, 1, 128]> ph_masks_in, tensor<fp32, [128]> ph_offset_in, tensor<fp32, [2, 128, 8, 64]> wp_att_key_cache_in, tensor<fp32, [12, 64, 8, 128]> wp_att_value_cache_in, tensor<fp32, [2, 128]> wp_c_cache_in, tensor<fp32, [12, 512, 1, 7]> wp_cnn_cache_in, tensor<fp32, [1, 1000, 64]> wp_ctx_emb, tensor<fp32, [1, 1, 1000]> wp_ctx_emb_mask, tensor<fp32, [2, 128]> wp_h_cache_in, tensor<fp32, [1, 1, 128]> wp_masks_in, tensor<fp32, [128]> wp_offset_in) [E5_FlagsEir = dict<tensor<string, []>, tensor<string, []>>({{"allowSoftmaxApproximation", "1"}, {"early_arch_conv_w_int8_no_bloat", "1"}, {"early_arch_extended_reshape", "1"}, {"experimental.ane.early_arch_transposes", "1"}, {"experimental.ane.enable_rsqrt", "1"}})] {
            tensor<int32, [1]> var_180_axes_0 = const()[name = tensor<string, []>("op_180_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<string, []> ph_offset_in_to_fp16_dtype_0 = const()[name = tensor<string, []>("ph_offset_in_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [128]> cast_63 = cast(dtype = ph_offset_in_to_fp16_dtype_0, x = ph_offset_in);
            tensor<fp16, [128, 1]> var_180_cast = expand_dims(axes = var_180_axes_0, x = cast_63);
            tensor<fp16, []> var_181_promoted_to_fp16 = const()[name = tensor<string, []>("op_181_promoted_to_fp16"), val = tensor<fp16, []>(-120)];
            tensor<fp16, [128, 1]> offset_1_cast = add(x = var_180_cast, y = var_181_promoted_to_fp16);
            tensor<fp16, [512, 1]> x_1_weight_0_to_fp16 = const()[name = tensor<string, []>("x_1_weight_0_to_fp16"), val = tensor<fp16, [512, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [512]> x_1_bias_0_to_fp16 = const()[name = tensor<string, []>("x_1_bias_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1152)))];
            tensor<fp16, [128, 512]> x_1_cast = linear(bias = x_1_bias_0_to_fp16, weight = x_1_weight_0_to_fp16, x = offset_1_cast);
            tensor<fp16, [128, 512]> var_185_cast = sin(x = x_1_cast);
            tensor<int32, [1]> pos_emb_1_axes_0 = const()[name = tensor<string, []>("pos_emb_1_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, 128, 512]> pos_emb_1_cast = expand_dims(axes = pos_emb_1_axes_0, x = var_185_cast);
            tensor<string, []> feat_to_fp16_dtype_0 = const()[name = tensor<string, []>("feat_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [80]> secondary_encoder_global_cmvn_mean_to_fp16 = const()[name = tensor<string, []>("secondary_encoder_global_cmvn_mean_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2240)))];
            tensor<fp16, [1, 29, 80]> cast_62 = cast(dtype = feat_to_fp16_dtype_0, x = feat);
            tensor<fp16, [1, 29, 80]> x_3_cast = sub(x = cast_62, y = secondary_encoder_global_cmvn_mean_to_fp16);
            tensor<fp16, [80]> secondary_encoder_global_cmvn_istd_to_fp16 = const()[name = tensor<string, []>("secondary_encoder_global_cmvn_istd_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2496)))];
            tensor<fp16, [1, 29, 80]> xs_3_cast = mul(x = x_3_cast, y = secondary_encoder_global_cmvn_istd_to_fp16);
            tensor<int32, [1]> var_194_axes_0 = const()[name = tensor<string, []>("op_194_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1, 512]> var_194_cast = expand_dims(axes = var_194_axes_0, x = pos_emb_1_cast);
            tensor<int32, [4]> var_199 = const()[name = tensor<string, []>("op_199"), val = tensor<int32, [4]>([1, -1, 1, 1])];
            tensor<string, []> ph_masks_in_to_fp16_dtype_0 = const()[name = tensor<string, []>("ph_masks_in_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 1, 128]> cast_61 = cast(dtype = ph_masks_in_to_fp16_dtype_0, x = ph_masks_in);
            tensor<fp16, [1, 128, 1, 1]> mask_1_cast = reshape(shape = var_199, x = cast_61);
            tensor<int32, []> var_226 = const()[name = tensor<string, []>("op_226"), val = tensor<int32, []>(-1)];
            tensor<bool, []> var_227_interleave_0 = const()[name = tensor<string, []>("op_227_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 512, 1, 25]> op_224_to_fp16_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("op_224_to_fp16_affine_quantized"), quantized_data = tensor<int8, [2, 512, 1, 25]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2752))), scale = tensor<fp16, [2]>([0.00787353516, 0.00787353516]), zero_point = tensor<int8, [2]>([0, 0])];
            tensor<string, []> ph_cnn_cache_in_to_fp16_dtype_0 = const()[name = tensor<string, []>("ph_cnn_cache_in_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [2, 512, 1, 7]> cast_60 = cast(dtype = ph_cnn_cache_in_to_fp16_dtype_0, x = ph_cnn_cache_in);
            tensor<fp16, [2, 512, 1, 32]> var_227_cast = concat(axis = var_226, interleave = var_227_interleave_0, values = (op_224_to_fp16_affine_quantized, cast_60));
            tensor<int32, [2]> tile_0 = const()[name = tensor<string, []>("tile_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_230_axis_0 = const()[name = tensor<string, []>("op_230_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, 512, 1, 32]> var_230_cast_0, tensor<fp16, [1, 512, 1, 32]> var_230_cast_1 = split(axis = var_230_axis_0, split_sizes = tile_0, x = var_227_cast);
            tensor<int32, [2]> tile_1 = const()[name = tensor<string, []>("tile_1"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_235_axis_0 = const()[name = tensor<string, []>("op_235_axis_0"), val = tensor<int32, []>(0)];
            tensor<string, []> ph_att_key_cache_in_to_fp16_dtype_0 = const()[name = tensor<string, []>("ph_att_key_cache_in_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [2, 128, 8, 64]> cast_59 = cast(dtype = ph_att_key_cache_in_to_fp16_dtype_0, x = ph_att_key_cache_in);
            tensor<fp16, [1, 128, 8, 64]> var_235_cast_0, tensor<fp16, [1, 128, 8, 64]> var_235_cast_1 = split(axis = var_235_axis_0, split_sizes = tile_1, x = cast_59);
            tensor<int32, [2]> tile_2 = const()[name = tensor<string, []>("tile_2"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_240_axis_0 = const()[name = tensor<string, []>("op_240_axis_0"), val = tensor<int32, []>(0)];
            tensor<string, []> ph_att_value_cache_in_to_fp16_dtype_0 = const()[name = tensor<string, []>("ph_att_value_cache_in_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [2, 64, 8, 128]> cast_58 = cast(dtype = ph_att_value_cache_in_to_fp16_dtype_0, x = ph_att_value_cache_in);
            tensor<fp16, [1, 64, 8, 128]> var_240_cast_0, tensor<fp16, [1, 64, 8, 128]> var_240_cast_1 = split(axis = var_240_axis_0, split_sizes = tile_2, x = cast_58);
            tensor<int32, [3]> var_245_perm_0 = const()[name = tensor<string, []>("op_245_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> x_9_axes_0 = const()[name = tensor<string, []>("x_9_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 80, 29]> transpose_25 = transpose(perm = var_245_perm_0, x = xs_3_cast);
            tensor<fp16, [1, 1, 80, 29]> x_9_cast = expand_dims(axes = x_9_axes_0, x = transpose_25);
            tensor<int32, [1]> var_251_axes_0 = const()[name = tensor<string, []>("op_251_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<string, []> wp_offset_in_to_fp16_dtype_0 = const()[name = tensor<string, []>("wp_offset_in_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [128]> cast_57 = cast(dtype = wp_offset_in_to_fp16_dtype_0, x = wp_offset_in);
            tensor<fp16, [128, 1]> var_251_cast = expand_dims(axes = var_251_axes_0, x = cast_57);
            tensor<fp16, []> var_252_promoted_to_fp16 = const()[name = tensor<string, []>("op_252_promoted_to_fp16"), val = tensor<fp16, []>(-124)];
            tensor<fp16, [128, 1]> offset_cast = add(x = var_251_cast, y = var_252_promoted_to_fp16);
            tensor<fp16, [512, 1]> x_5_weight_0_to_fp16 = const()[name = tensor<string, []>("x_5_weight_0_to_fp16"), val = tensor<fp16, [512, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28416)))];
            tensor<fp16, [512]> x_5_bias_0_to_fp16 = const()[name = tensor<string, []>("x_5_bias_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29504)))];
            tensor<fp16, [128, 512]> x_5_cast = linear(bias = x_5_bias_0_to_fp16, weight = x_5_weight_0_to_fp16, x = offset_cast);
            tensor<fp16, [128, 512]> var_256_cast = sin(x = x_5_cast);
            tensor<int32, [1]> pos_emb_axes_0 = const()[name = tensor<string, []>("pos_emb_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, 128, 512]> pos_emb_cast = expand_dims(axes = pos_emb_axes_0, x = var_256_cast);
            tensor<fp16, [80]> primary_encoder_global_cmvn_mean_to_fp16 = const()[name = tensor<string, []>("primary_encoder_global_cmvn_mean_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30592)))];
            tensor<fp16, [1, 29, 80]> x_7_cast = sub(x = cast_62, y = primary_encoder_global_cmvn_mean_to_fp16);
            tensor<fp16, [80]> primary_encoder_global_cmvn_istd_to_fp16 = const()[name = tensor<string, []>("primary_encoder_global_cmvn_istd_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30848)))];
            tensor<fp16, [1, 29, 80]> xs_5_cast = mul(x = x_7_cast, y = primary_encoder_global_cmvn_istd_to_fp16);
            tensor<int32, [1]> var_265_axes_0 = const()[name = tensor<string, []>("op_265_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 128, 1, 512]> var_265_cast = expand_dims(axes = var_265_axes_0, x = pos_emb_cast);
            tensor<int32, [4]> var_270 = const()[name = tensor<string, []>("op_270"), val = tensor<int32, [4]>([1, -1, 1, 1])];
            tensor<string, []> wp_masks_in_to_fp16_dtype_0 = const()[name = tensor<string, []>("wp_masks_in_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 1, 128]> cast_56 = cast(dtype = wp_masks_in_to_fp16_dtype_0, x = wp_masks_in);
            tensor<fp16, [1, 128, 1, 1]> mask_3_cast = reshape(shape = var_270, x = cast_56);
            tensor<int32, []> var_297 = const()[name = tensor<string, []>("op_297"), val = tensor<int32, []>(-1)];
            tensor<bool, []> var_298_interleave_0 = const()[name = tensor<string, []>("op_298_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 512, 1, 25]> op_295_to_fp16_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("op_295_to_fp16_affine_quantized"), quantized_data = tensor<int8, [12, 512, 1, 25]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31104))), scale = tensor<fp16, [12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(184896))), zero_point = tensor<int8, [12]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(184768)))];
            tensor<string, []> wp_cnn_cache_in_to_fp16_dtype_0 = const()[name = tensor<string, []>("wp_cnn_cache_in_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [12, 512, 1, 7]> cast_55 = cast(dtype = wp_cnn_cache_in_to_fp16_dtype_0, x = wp_cnn_cache_in);
            tensor<fp16, [12, 512, 1, 32]> var_298_cast = concat(axis = var_297, interleave = var_298_interleave_0, values = (op_295_to_fp16_affine_quantized, cast_55));
            tensor<int32, [12]> tile_3 = const()[name = tensor<string, []>("tile_3"), val = tensor<int32, [12]>([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1])];
            tensor<int32, []> var_301_axis_0 = const()[name = tensor<string, []>("op_301_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, 512, 1, 32]> var_301_cast_0, tensor<fp16, [1, 512, 1, 32]> var_301_cast_1, tensor<fp16, [1, 512, 1, 32]> var_301_cast_2, tensor<fp16, [1, 512, 1, 32]> var_301_cast_3, tensor<fp16, [1, 512, 1, 32]> var_301_cast_4, tensor<fp16, [1, 512, 1, 32]> var_301_cast_5, tensor<fp16, [1, 512, 1, 32]> var_301_cast_6, tensor<fp16, [1, 512, 1, 32]> var_301_cast_7, tensor<fp16, [1, 512, 1, 32]> var_301_cast_8, tensor<fp16, [1, 512, 1, 32]> var_301_cast_9, tensor<fp16, [1, 512, 1, 32]> var_301_cast_10, tensor<fp16, [1, 512, 1, 32]> var_301_cast_11 = split(axis = var_301_axis_0, split_sizes = tile_3, x = var_298_cast);
            tensor<int32, [2]> tile_4 = const()[name = tensor<string, []>("tile_4"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_316_axis_0 = const()[name = tensor<string, []>("op_316_axis_0"), val = tensor<int32, []>(0)];
            tensor<string, []> wp_att_key_cache_in_to_fp16_dtype_0 = const()[name = tensor<string, []>("wp_att_key_cache_in_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [2, 128, 8, 64]> cast_54 = cast(dtype = wp_att_key_cache_in_to_fp16_dtype_0, x = wp_att_key_cache_in);
            tensor<fp16, [1, 128, 8, 64]> var_316_cast_0, tensor<fp16, [1, 128, 8, 64]> var_316_cast_1 = split(axis = var_316_axis_0, split_sizes = tile_4, x = cast_54);
            tensor<int32, [12]> tile_5 = const()[name = tensor<string, []>("tile_5"), val = tensor<int32, [12]>([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1])];
            tensor<int32, []> var_321_axis_0 = const()[name = tensor<string, []>("op_321_axis_0"), val = tensor<int32, []>(0)];
            tensor<string, []> wp_att_value_cache_in_to_fp16_dtype_0 = const()[name = tensor<string, []>("wp_att_value_cache_in_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [12, 64, 8, 128]> cast_53 = cast(dtype = wp_att_value_cache_in_to_fp16_dtype_0, x = wp_att_value_cache_in);
            tensor<fp16, [1, 64, 8, 128]> var_321_cast_0, tensor<fp16, [1, 64, 8, 128]> var_321_cast_1, tensor<fp16, [1, 64, 8, 128]> var_321_cast_2, tensor<fp16, [1, 64, 8, 128]> var_321_cast_3, tensor<fp16, [1, 64, 8, 128]> var_321_cast_4, tensor<fp16, [1, 64, 8, 128]> var_321_cast_5, tensor<fp16, [1, 64, 8, 128]> var_321_cast_6, tensor<fp16, [1, 64, 8, 128]> var_321_cast_7, tensor<fp16, [1, 64, 8, 128]> var_321_cast_8, tensor<fp16, [1, 64, 8, 128]> var_321_cast_9, tensor<fp16, [1, 64, 8, 128]> var_321_cast_10, tensor<fp16, [1, 64, 8, 128]> var_321_cast_11 = split(axis = var_321_axis_0, split_sizes = tile_5, x = cast_53);
            tensor<int32, [3]> var_336_perm_0 = const()[name = tensor<string, []>("op_336_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> x_129_axes_0 = const()[name = tensor<string, []>("x_129_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 80, 29]> transpose_24 = transpose(perm = var_336_perm_0, x = xs_5_cast);
            tensor<fp16, [1, 1, 80, 29]> x_129_cast = expand_dims(axes = x_129_axes_0, x = transpose_24);
            tensor<int32, [3]> var_341_perm_0 = const()[name = tensor<string, []>("op_341_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> wp_ctx_emb_to_fp16_dtype_0 = const()[name = tensor<string, []>("wp_ctx_emb_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<int32, [1]> x_797_axes_0 = const()[name = tensor<string, []>("x_797_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1000, 64]> cast_52 = cast(dtype = wp_ctx_emb_to_fp16_dtype_0, x = wp_ctx_emb);
            tensor<fp16, [1, 64, 1000]> transpose_23 = transpose(perm = var_341_perm_0, x = cast_52);
            tensor<fp16, [1, 64, 1, 1000]> x_797_cast = expand_dims(axes = x_797_axes_0, x = transpose_23);
            tensor<int32, [4]> var_348 = const()[name = tensor<string, []>("op_348"), val = tensor<int32, [4]>([1, -1, 1, 1])];
            tensor<string, []> wp_ctx_emb_mask_to_fp16_dtype_0 = const()[name = tensor<string, []>("wp_ctx_emb_mask_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 1, 1000]> cast_51 = cast(dtype = wp_ctx_emb_mask_to_fp16_dtype_0, x = wp_ctx_emb_mask);
            tensor<fp16, [1, 1000, 1, 1]> mask_cast = reshape(shape = var_348, x = cast_51);
            tensor<int32, [1]> var_361_axes_0 = const()[name = tensor<string, []>("op_361_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<string, []> wp_h_cache_in_to_fp16_dtype_0 = const()[name = tensor<string, []>("wp_h_cache_in_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [2, 128]> cast_50 = cast(dtype = wp_h_cache_in_to_fp16_dtype_0, x = wp_h_cache_in);
            tensor<fp16, [2, 128, 1]> var_361_cast = expand_dims(axes = var_361_axes_0, x = cast_50);
            tensor<int32, [1]> var_363_axes_0 = const()[name = tensor<string, []>("op_363_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [2, 128, 1, 1]> var_363_cast = expand_dims(axes = var_363_axes_0, x = var_361_cast);
            tensor<int32, [2]> tile_6 = const()[name = tensor<string, []>("tile_6"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_366_axis_0 = const()[name = tensor<string, []>("op_366_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, 128, 1, 1]> var_366_cast_0, tensor<fp16, [1, 128, 1, 1]> var_366_cast_1 = split(axis = var_366_axis_0, split_sizes = tile_6, x = var_363_cast);
            tensor<int32, [1]> var_380_axes_0 = const()[name = tensor<string, []>("op_380_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<string, []> wp_c_cache_in_to_fp16_dtype_0 = const()[name = tensor<string, []>("wp_c_cache_in_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [2, 128]> cast_49 = cast(dtype = wp_c_cache_in_to_fp16_dtype_0, x = wp_c_cache_in);
            tensor<fp16, [2, 128, 1]> var_380_cast = expand_dims(axes = var_380_axes_0, x = cast_49);
            tensor<int32, [1]> var_382_axes_0 = const()[name = tensor<string, []>("op_382_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [2, 128, 1, 1]> var_382_cast = expand_dims(axes = var_382_axes_0, x = var_380_cast);
            tensor<int32, [2]> tile_7 = const()[name = tensor<string, []>("tile_7"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_385_axis_0 = const()[name = tensor<string, []>("op_385_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, 128, 1, 1]> var_385_cast_0, tensor<fp16, [1, 128, 1, 1]> var_385_cast_1 = split(axis = var_385_axis_0, split_sizes = tile_7, x = var_382_cast);
            tensor<int32, []> var_393 = const()[name = tensor<string, []>("op_393"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> input_1_perm_0 = const()[name = tensor<string, []>("input_1_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [2]> var_398 = const()[name = tensor<string, []>("op_398"), val = tensor<int32, [2]>([1, 3])];
            tensor<int32, [2]> var_400 = const()[name = tensor<string, []>("op_400"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_11_pad_type_0 = const()[name = tensor<string, []>("x_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_11_pad_0 = const()[name = tensor<string, []>("x_11_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 80, 1, 7]> secondary_encoder_embed_out_weight_to_fp16_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("secondary_encoder_embed_out_weight_to_fp16_affine_quantized"), quantized_data = tensor<int8, [512, 80, 1, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(185024))), scale = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(472384))), zero_point = tensor<int8, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(471808)))];
            tensor<fp16, [512]> secondary_encoder_embed_out_bias_to_fp16 = const()[name = tensor<string, []>("secondary_encoder_embed_out_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(473472)))];
            tensor<fp16, [1, 80, 1, 29]> transpose_22 = transpose(perm = input_1_perm_0, x = x_9_cast);
            tensor<fp16, [1, 512, 1, 8]> x_11_cast = conv(bias = secondary_encoder_embed_out_bias_to_fp16, dilations = var_400, groups = var_393, pad = x_11_pad_0, pad_type = x_11_pad_type_0, strides = var_398, weight = secondary_encoder_embed_out_weight_to_fp16_affine_quantized, x = transpose_22);
            tensor<int32, []> var_408 = const()[name = tensor<string, []>("op_408"), val = tensor<int32, []>(512)];
            tensor<int32, []> var_415 = const()[name = tensor<string, []>("op_415"), val = tensor<int32, []>(2)];
            tensor<int32, []> var_418 = const()[name = tensor<string, []>("op_418"), val = tensor<int32, []>(-1)];
            tensor<bool, []> var_420 = const()[name = tensor<string, []>("op_420"), val = tensor<bool, []>(true)];
            tensor<int32, []> var_421 = const()[name = tensor<string, []>("op_421"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 512, 1, 8]> var_468_cast = abs(x = x_11_cast);
            tensor<fp16, []> var_469_to_fp16 = const()[name = tensor<string, []>("op_469_to_fp16"), val = tensor<fp16, []>(0.001953125)];
            tensor<fp16, [1, 512, 1, 8]> var_470_cast = mul(x = var_468_cast, y = var_469_to_fp16);
            tensor<int32, [1]> var_471 = const()[name = tensor<string, []>("op_471"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 8]> scale_1_cast = reduce_sum(axes = var_471, keep_dims = var_420, x = var_470_cast);
            tensor<fp16, []> scale_3_epsilon_0_to_fp16 = const()[name = tensor<string, []>("scale_3_epsilon_0_to_fp16"), val = tensor<fp16, []>(5.96046448e-08)];
            tensor<fp16, [1, 1, 1, 8]> scale_3_cast = rsqrt(epsilon = scale_3_epsilon_0_to_fp16, x = scale_1_cast);
            tensor<fp16, [1, 1, 1, 8]> scale_5_cast = mul(x = scale_3_cast, y = scale_3_cast);
            tensor<fp16, [1, 512, 1, 8]> x_13_cast = mul(x = x_11_cast, y = scale_5_cast);
            tensor<fp16, []> var_476_to_fp16 = const()[name = tensor<string, []>("op_476_to_fp16"), val = tensor<fp16, []>(-0.001953125)];
            tensor<fp16, [1, 512, 1, 8]> var_477_cast = mul(x = x_13_cast, y = var_476_to_fp16);
            tensor<int32, [1]> var_478 = const()[name = tensor<string, []>("op_478"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 8]> x_mean_1_cast = reduce_sum(axes = var_478, keep_dims = var_420, x = var_477_cast);
            tensor<fp16, [1, 512, 1, 8]> x_zero_mean_1_cast = add(x = x_13_cast, y = x_mean_1_cast);
            tensor<fp16, []> var_481_to_fp16 = const()[name = tensor<string, []>("op_481_to_fp16"), val = tensor<fp16, []>(0.001953125)];
            tensor<fp16, [1, 512, 1, 8]> var_482_cast = mul(x = x_zero_mean_1_cast, y = var_481_to_fp16);
            tensor<fp16, [1, 512, 1, 8]> var_483_cast = mul(x = var_482_cast, y = x_zero_mean_1_cast);
            tensor<int32, [1]> var_484 = const()[name = tensor<string, []>("op_484"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 8]> x_var_1_cast = reduce_sum(axes = var_484, keep_dims = var_420, x = var_483_cast);
            tensor<fp16, []> var_486_to_fp16 = const()[name = tensor<string, []>("op_486_to_fp16"), val = tensor<fp16, []>(1.00135803e-05)];
            tensor<fp16, [1, 1, 1, 8]> var_487_cast = add(x = x_var_1_cast, y = var_486_to_fp16);
            tensor<fp16, []> var_488_epsilon_0_to_fp16 = const()[name = tensor<string, []>("op_488_epsilon_0_to_fp16"), val = tensor<fp16, []>(5.96046448e-08)];
            tensor<fp16, [1, 1, 1, 8]> var_488_cast = rsqrt(epsilon = var_488_epsilon_0_to_fp16, x = var_487_cast);
            tensor<fp16, [1, 512, 1, 8]> var_489_cast = mul(x = x_zero_mean_1_cast, y = var_488_cast);
            tensor<fp16, [512]> x_15_mean_0_to_fp16 = const()[name = tensor<string, []>("x_15_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(474560)))];
            tensor<fp16, [512]> x_15_variance_0_to_fp16 = const()[name = tensor<string, []>("x_15_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(475648)))];
            tensor<fp16, [512]> x_15_gamma_0_to_fp16 = const()[name = tensor<string, []>("x_15_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(476736)))];
            tensor<fp16, [512]> x_15_beta_0_to_fp16 = const()[name = tensor<string, []>("x_15_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(477824)))];
            tensor<fp16, []> x_15_epsilon_0_to_fp16 = const()[name = tensor<string, []>("x_15_epsilon_0_to_fp16"), val = tensor<fp16, []>(1.00135803e-05)];
            tensor<fp16, [1, 512, 1, 8]> x_15_cast = batch_norm(beta = x_15_beta_0_to_fp16, epsilon = x_15_epsilon_0_to_fp16, gamma = x_15_gamma_0_to_fp16, mean = x_15_mean_0_to_fp16, variance = x_15_variance_0_to_fp16, x = var_489_cast);
            tensor<int32, [2]> var_500 = const()[name = tensor<string, []>("op_500"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_502 = const()[name = tensor<string, []>("op_502"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [2048, 512, 1, 1]> op_499_to_fp16_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("op_499_to_fp16_affine_quantized"), quantized_data = tensor<int8, [2048, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(478912))), scale = tensor<fp16, [2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1529664))), zero_point = tensor<int8, [2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1527552)))];
            tensor<fp16, [2048]> secondary_encoder_encoders_0_feed_forward_macaron_w_1_bias_to_fp16 = const()[name = tensor<string, []>("secondary_encoder_encoders_0_feed_forward_macaron_w_1_bias_to_fp16"), val = tensor<fp16, [2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1533824)))];
            tensor<fp16, [1, 2048, 1, 8]> input_3_cast = conv(bias = secondary_encoder_encoders_0_feed_forward_macaron_w_1_bias_to_fp16, dilations = var_502, groups = var_421, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = var_500, weight = op_499_to_fp16_affine_quantized, x = x_15_cast);
            tensor<fp16, [1, 2048, 1, 8]> input_5_cast = silu(x = input_3_cast);
            tensor<int32, [2]> var_511 = const()[name = tensor<string, []>("op_511"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_513 = const()[name = tensor<string, []>("op_513"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 2048, 1, 1]> op_518_weight_0_to_fp16_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("op_518_weight_0_to_fp16_affine_quantized"), quantized_data = tensor<int8, [512, 2048, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1537984))), scale = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2587200))), zero_point = tensor<int8, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2586624)))];
            tensor<fp16, [512]> var_518_bias_0_to_fp16 = const()[name = tensor<string, []>("op_518_bias_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2588288)))];
            tensor<fp16, [1, 512, 1, 8]> var_518_cast = conv(bias = var_518_bias_0_to_fp16, dilations = var_513, groups = var_421, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = var_511, weight = op_518_weight_0_to_fp16_affine_quantized, x = input_5_cast);
            tensor<fp16, [1, 512, 1, 8]> x_21_cast = add(x = x_11_cast, y = var_518_cast);
            tensor<fp16, [1, 512, 1, 8]> var_520_cast = abs(x = x_21_cast);
            tensor<fp16, []> var_521_to_fp16 = const()[name = tensor<string, []>("op_521_to_fp16"), val = tensor<fp16, []>(0.001953125)];
            tensor<fp16, [1, 512, 1, 8]> var_522_cast = mul(x = var_520_cast, y = var_521_to_fp16);
            tensor<int32, [1]> var_523 = const()[name = tensor<string, []>("op_523"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 8]> scale_7_cast = reduce_sum(axes = var_523, keep_dims = var_420, x = var_522_cast);
            tensor<fp16, []> scale_9_epsilon_0_to_fp16 = const()[name = tensor<string, []>("scale_9_epsilon_0_to_fp16"), val = tensor<fp16, []>(5.96046448e-08)];
            tensor<fp16, [1, 1, 1, 8]> scale_9_cast = rsqrt(epsilon = scale_9_epsilon_0_to_fp16, x = scale_7_cast);
            tensor<fp16, [1, 1, 1, 8]> scale_11_cast = mul(x = scale_9_cast, y = scale_9_cast);
            tensor<fp16, [1, 512, 1, 8]> x_23_cast = mul(x = x_21_cast, y = scale_11_cast);
            tensor<fp16, []> var_528_to_fp16 = const()[name = tensor<string, []>("op_528_to_fp16"), val = tensor<fp16, []>(-0.001953125)];
            tensor<fp16, [1, 512, 1, 8]> var_529_cast = mul(x = x_23_cast, y = var_528_to_fp16);
            tensor<int32, [1]> var_530 = const()[name = tensor<string, []>("op_530"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 8]> x_mean_3_cast = reduce_sum(axes = var_530, keep_dims = var_420, x = var_529_cast);
            tensor<fp16, [1, 512, 1, 8]> x_zero_mean_3_cast = add(x = x_23_cast, y = x_mean_3_cast);
            tensor<fp16, []> var_533_to_fp16 = const()[name = tensor<string, []>("op_533_to_fp16"), val = tensor<fp16, []>(0.001953125)];
            tensor<fp16, [1, 512, 1, 8]> var_534_cast = mul(x = x_zero_mean_3_cast, y = var_533_to_fp16);
            tensor<fp16, [1, 512, 1, 8]> var_535_cast = mul(x = var_534_cast, y = x_zero_mean_3_cast);
            tensor<int32, [1]> var_536 = const()[name = tensor<string, []>("op_536"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 8]> x_var_3_cast = reduce_sum(axes = var_536, keep_dims = var_420, x = var_535_cast);
            tensor<fp16, []> var_538_to_fp16 = const()[name = tensor<string, []>("op_538_to_fp16"), val = tensor<fp16, []>(1.00135803e-05)];
            tensor<fp16, [1, 1, 1, 8]> var_539_cast = add(x = x_var_3_cast, y = var_538_to_fp16);
            tensor<fp16, []> var_540_epsilon_0_to_fp16 = const()[name = tensor<string, []>("op_540_epsilon_0_to_fp16"), val = tensor<fp16, []>(5.96046448e-08)];
            tensor<fp16, [1, 1, 1, 8]> var_540_cast = rsqrt(epsilon = var_540_epsilon_0_to_fp16, x = var_539_cast);
            tensor<fp16, [1, 512, 1, 8]> var_541_cast = mul(x = x_zero_mean_3_cast, y = var_540_cast);
            tensor<fp16, [512]> x_25_mean_0_to_fp16 = const()[name = tensor<string, []>("x_25_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2589376)))];
            tensor<fp16, [512]> x_25_variance_0_to_fp16 = const()[name = tensor<string, []>("x_25_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2590464)))];
            tensor<fp16, [512]> x_25_gamma_0_to_fp16 = const()[name = tensor<string, []>("x_25_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2591552)))];
            tensor<fp16, [512]> x_25_beta_0_to_fp16 = const()[name = tensor<string, []>("x_25_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2592640)))];
            tensor<fp16, []> x_25_epsilon_0_to_fp16 = const()[name = tensor<string, []>("x_25_epsilon_0_to_fp16"), val = tensor<fp16, []>(1.00135803e-05)];
            tensor<fp16, [1, 512, 1, 8]> x_25_cast = batch_norm(beta = x_25_beta_0_to_fp16, epsilon = x_25_epsilon_0_to_fp16, gamma = x_25_gamma_0_to_fp16, mean = x_25_mean_0_to_fp16, variance = x_25_variance_0_to_fp16, x = var_541_cast);
            tensor<int32, [2]> var_572 = const()[name = tensor<string, []>("op_572"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_574 = const()[name = tensor<string, []>("op_574"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> y_1_pad_type_0 = const()[name = tensor<string, []>("y_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> y_1_pad_0 = const()[name = tensor<string, []>("y_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> op_578_weight_0_to_fp16_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("op_578_weight_0_to_fp16_affine_quantized"), quantized_data = tensor<int8, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2593728))), scale = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2856512))), zero_point = tensor<int8, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2855936)))];
            tensor<fp16, [512]> var_578_bias_0_to_fp16 = const()[name = tensor<string, []>("op_578_bias_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2857600)))];
            tensor<fp16, [1, 512, 1, 8]> var_578_cast = conv(bias = var_578_bias_0_to_fp16, dilations = var_574, groups = var_421, pad = y_1_pad_0, pad_type = y_1_pad_type_0, strides = var_572, weight = op_578_weight_0_to_fp16_affine_quantized, x = x_25_cast);
            tensor<int32, [8]> tile_8 = const()[name = tensor<string, []>("tile_8"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_579_axis_0 = const()[name = tensor<string, []>("op_579_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 8]> var_579_cast_0, tensor<fp16, [1, 64, 1, 8]> var_579_cast_1, tensor<fp16, [1, 64, 1, 8]> var_579_cast_2, tensor<fp16, [1, 64, 1, 8]> var_579_cast_3, tensor<fp16, [1, 64, 1, 8]> var_579_cast_4, tensor<fp16, [1, 64, 1, 8]> var_579_cast_5, tensor<fp16, [1, 64, 1, 8]> var_579_cast_6, tensor<fp16, [1, 64, 1, 8]> var_579_cast_7 = split(axis = var_579_axis_0, split_sizes = tile_8, x = var_578_cast);
            tensor<int32, [2]> var_592 = const()[name = tensor<string, []>("op_592"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_594 = const()[name = tensor<string, []>("op_594"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> var_596_pad_type_0 = const()[name = tensor<string, []>("op_596_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_596_pad_0 = const()[name = tensor<string, []>("op_596_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> op_591_to_fp16_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("op_591_to_fp16_affine_quantized"), quantized_data = tensor<int8, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2858688))), scale = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3121472))), zero_point = tensor<int8, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3120896)))];
            tensor<fp16, [512]> secondary_encoder_encoders_0_self_attn_linear_v_bias_to_fp16 = const()[name = tensor<string, []>("secondary_encoder_encoders_0_self_attn_linear_v_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3122560)))];
            tensor<fp16, [1, 512, 1, 8]> var_596_cast = conv(bias = secondary_encoder_encoders_0_self_attn_linear_v_bias_to_fp16, dilations = var_594, groups = var_421, pad = var_596_pad_0, pad_type = var_596_pad_type_0, strides = var_592, weight = op_591_to_fp16_affine_quantized, x = x_25_cast);
            tensor<int32, [8]> tile_9 = const()[name = tensor<string, []>("tile_9"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_597_axis_0 = const()[name = tensor<string, []>("op_597_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 8]> var_597_cast_0, tensor<fp16, [1, 64, 1, 8]> var_597_cast_1, tensor<fp16, [1, 64, 1, 8]> var_597_cast_2, tensor<fp16, [1, 64, 1, 8]> var_597_cast_3, tensor<fp16, [1, 64, 1, 8]> var_597_cast_4, tensor<fp16, [1, 64, 1, 8]> var_597_cast_5, tensor<fp16, [1, 64, 1, 8]> var_597_cast_6, tensor<fp16, [1, 64, 1, 8]> var_597_cast_7 = split(axis = var_597_axis_0, split_sizes = tile_9, x = var_596_cast);
            tensor<int32, [4]> var_606_perm_0 = const()[name = tensor<string, []>("op_606_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<string, []> var_613_equation_0 = const()[name = tensor<string, []>("op_613_equation_0"), val = tensor<string, []>("bnhd,bdhm->bnhm")];
            tensor<fp16, [1, 512, 1, 512]> op_610_to_fp16_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("op_610_to_fp16_affine_quantized"), quantized_data = tensor<int8, [1, 512, 1, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3123648))), scale = tensor<fp16, []>(0.0186920166), zero_point = tensor<int8, []>(0)];
            tensor<fp16, [1, 8, 1, 512]> transpose_21 = transpose(perm = var_606_perm_0, x = x_25_cast);
            tensor<fp16, [1, 8, 1, 512]> var_613_cast = einsum(equation = var_613_equation_0, values = (transpose_21, op_610_to_fp16_affine_quantized));
            tensor<fp16, [512]> secondary_encoder_encoders_0_self_attn_linear_k_bias_to_fp16 = const()[name = tensor<string, []>("secondary_encoder_encoders_0_self_attn_linear_k_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3385856)))];
            tensor<fp16, [1, 8, 1, 512]> var_614_cast = add(x = var_613_cast, y = secondary_encoder_encoders_0_self_attn_linear_k_bias_to_fp16);
            tensor<int32, [8]> tile_10 = const()[name = tensor<string, []>("tile_10"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_615_axis_0 = const()[name = tensor<string, []>("op_615_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 8, 1, 64]> var_615_cast_0, tensor<fp16, [1, 8, 1, 64]> var_615_cast_1, tensor<fp16, [1, 8, 1, 64]> var_615_cast_2, tensor<fp16, [1, 8, 1, 64]> var_615_cast_3, tensor<fp16, [1, 8, 1, 64]> var_615_cast_4, tensor<fp16, [1, 8, 1, 64]> var_615_cast_5, tensor<fp16, [1, 8, 1, 64]> var_615_cast_6, tensor<fp16, [1, 8, 1, 64]> var_615_cast_7 = split(axis = var_615_axis_0, split_sizes = tile_10, x = var_614_cast);
            tensor<int32, [8]> tile_11 = const()[name = tensor<string, []>("tile_11"), val = tensor<int32, [8]>([1, 1, 1, 1, 1, 1, 1, 1])];
            tensor<int32, []> var_625_axis_0 = const()[name = tensor<string, []>("op_625_axis_0"), val = tensor<int32, []>(2)];
            tensor<fp16, [1, 128, 1, 64]> var_625_cast_0, tensor<fp16, [1, 128, 1, 64]> var_625_cast_1, tensor<fp16, [1, 128, 1, 64]> var_625_cast_2, tensor<fp16, [1, 128, 1, 64]> var_625_cast_3, tensor<fp16, [1, 128, 1, 64]> var_625_cast_4, tensor<fp16, [1, 128, 1, 64]> var_625_cast_5, tensor<fp16, [1, 128, 1, 64]> var_625_cast_6, tensor<fp16, [1, 128, 1, 64]> var_625_cast_7 = split(axis = var_625_axis_0, split_sizes = tile_11, x = var_235_cast_0);
            tensor<int32, [8]> tile_12 = const()[name = tensor<string, []>("tile_12"), val = tensor<int32, [8]>([1, 1, 1, 1, 1, 1, 1, 1])];
            tensor<int32, []> var_634_axis_0 = const()[name = tensor<string, []>("op_634_axis_0"), val = tensor<int32, []>(2)];
            tensor<fp16, [1, 64, 1, 128]> var_634_cast_0, tensor<fp16, [1, 64, 1, 128]> var_634_cast_1, tensor<fp16, [1, 64, 1, 128]> var_634_cast_2, tensor<fp16, [1, 64, 1, 128]> var_634_cast_3, tensor<fp16, [1, 64, 1, 128]> var_634_cast_4, tensor<fp16, [1, 64, 1, 128]> var_634_cast_5, tensor<fp16, [1, 64, 1, 128]> var_634_cast_6, tensor<fp16, [1, 64, 1, 128]> var_634_cast_7 = split(axis = var_634_axis_0, split_sizes = tile_12, x = var_240_cast_0);
            tensor<bool, []> var_644_interleave_0 = const()[name = tensor<string, []>("op_644_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 136, 1, 64]> var_644_cast = concat(axis = var_421, interleave = var_644_interleave_0, values = (var_625_cast_0, var_615_cast_0));
            tensor<int32, [4]> var_646_begin_0 = const()[name = tensor<string, []>("op_646_begin_0"), val = tensor<int32, [4]>([0, 8, 0, 0])];
            tensor<int32, [4]> var_646_end_0 = const()[name = tensor<string, []>("op_646_end_0"), val = tensor<int32, [4]>([1, 136, 1, 64])];
            tensor<bool, [4]> var_646_end_mask_0 = const()[name = tensor<string, []>("op_646_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 128, 1, 64]> var_646_cast = slice_by_index(begin = var_646_begin_0, end = var_646_end_0, end_mask = var_646_end_mask_0, x = var_644_cast);
            tensor<bool, []> var_650_interleave_0 = const()[name = tensor<string, []>("op_650_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 136, 1, 64]> var_650_cast = concat(axis = var_421, interleave = var_650_interleave_0, values = (var_625_cast_1, var_615_cast_1));
            tensor<int32, [4]> var_652_begin_0 = const()[name = tensor<string, []>("op_652_begin_0"), val = tensor<int32, [4]>([0, 8, 0, 0])];
            tensor<int32, [4]> var_652_end_0 = const()[name = tensor<string, []>("op_652_end_0"), val = tensor<int32, [4]>([1, 136, 1, 64])];
            tensor<bool, [4]> var_652_end_mask_0 = const()[name = tensor<string, []>("op_652_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 128, 1, 64]> var_652_cast = slice_by_index(begin = var_652_begin_0, end = var_652_end_0, end_mask = var_652_end_mask_0, x = var_650_cast);
            tensor<bool, []> var_656_interleave_0 = const()[name = tensor<string, []>("op_656_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 136, 1, 64]> var_656_cast = concat(axis = var_421, interleave = var_656_interleave_0, values = (var_625_cast_2, var_615_cast_2));
            tensor<int32, [4]> var_658_begin_0 = const()[name = tensor<string, []>("op_658_begin_0"), val = tensor<int32, [4]>([0, 8, 0, 0])];
            tensor<int32, [4]> var_658_end_0 = const()[name = tensor<string, []>("op_658_end_0"), val = tensor<int32, [4]>([1, 136, 1, 64])];
            tensor<bool, [4]> var_658_end_mask_0 = const()[name = tensor<string, []>("op_658_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 128, 1, 64]> var_658_cast = slice_by_index(begin = var_658_begin_0, end = var_658_end_0, end_mask = var_658_end_mask_0, x = var_656_cast);
            tensor<bool, []> var_662_interleave_0 = const()[name = tensor<string, []>("op_662_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 136, 1, 64]> var_662_cast = concat(axis = var_421, interleave = var_662_interleave_0, values = (var_625_cast_3, var_615_cast_3));
            tensor<int32, [4]> var_664_begin_0 = const()[name = tensor<string, []>("op_664_begin_0"), val = tensor<int32, [4]>([0, 8, 0, 0])];
            tensor<int32, [4]> var_664_end_0 = const()[name = tensor<string, []>("op_664_end_0"), val = tensor<int32, [4]>([1, 136, 1, 64])];
            tensor<bool, [4]> var_664_end_mask_0 = const()[name = tensor<string, []>("op_664_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 128, 1, 64]> var_664_cast = slice_by_index(begin = var_664_begin_0, end = var_664_end_0, end_mask = var_664_end_mask_0, x = var_662_cast);
            tensor<bool, []> var_668_interleave_0 = const()[name = tensor<string, []>("op_668_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 136, 1, 64]> var_668_cast = concat(axis = var_421, interleave = var_668_interleave_0, values = (var_625_cast_4, var_615_cast_4));
            tensor<int32, [4]> var_670_begin_0 = const()[name = tensor<string, []>("op_670_begin_0"), val = tensor<int32, [4]>([0, 8, 0, 0])];
            tensor<int32, [4]> var_670_end_0 = const()[name = tensor<string, []>("op_670_end_0"), val = tensor<int32, [4]>([1, 136, 1, 64])];
            tensor<bool, [4]> var_670_end_mask_0 = const()[name = tensor<string, []>("op_670_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 128, 1, 64]> var_670_cast = slice_by_index(begin = var_670_begin_0, end = var_670_end_0, end_mask = var_670_end_mask_0, x = var_668_cast);
            tensor<bool, []> var_674_interleave_0 = const()[name = tensor<string, []>("op_674_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 136, 1, 64]> var_674_cast = concat(axis = var_421, interleave = var_674_interleave_0, values = (var_625_cast_5, var_615_cast_5));
            tensor<int32, [4]> var_676_begin_0 = const()[name = tensor<string, []>("op_676_begin_0"), val = tensor<int32, [4]>([0, 8, 0, 0])];
            tensor<int32, [4]> var_676_end_0 = const()[name = tensor<string, []>("op_676_end_0"), val = tensor<int32, [4]>([1, 136, 1, 64])];
            tensor<bool, [4]> var_676_end_mask_0 = const()[name = tensor<string, []>("op_676_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 128, 1, 64]> var_676_cast = slice_by_index(begin = var_676_begin_0, end = var_676_end_0, end_mask = var_676_end_mask_0, x = var_674_cast);
            tensor<bool, []> var_680_interleave_0 = const()[name = tensor<string, []>("op_680_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 136, 1, 64]> var_680_cast = concat(axis = var_421, interleave = var_680_interleave_0, values = (var_625_cast_6, var_615_cast_6));
            tensor<int32, [4]> var_682_begin_0 = const()[name = tensor<string, []>("op_682_begin_0"), val = tensor<int32, [4]>([0, 8, 0, 0])];
            tensor<int32, [4]> var_682_end_0 = const()[name = tensor<string, []>("op_682_end_0"), val = tensor<int32, [4]>([1, 136, 1, 64])];
            tensor<bool, [4]> var_682_end_mask_0 = const()[name = tensor<string, []>("op_682_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 128, 1, 64]> var_682_cast = slice_by_index(begin = var_682_begin_0, end = var_682_end_0, end_mask = var_682_end_mask_0, x = var_680_cast);
            tensor<bool, []> var_686_interleave_0 = const()[name = tensor<string, []>("op_686_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 136, 1, 64]> var_686_cast = concat(axis = var_421, interleave = var_686_interleave_0, values = (var_625_cast_7, var_615_cast_7));
            tensor<int32, [4]> var_688_begin_0 = const()[name = tensor<string, []>("op_688_begin_0"), val = tensor<int32, [4]>([0, 8, 0, 0])];
            tensor<int32, [4]> var_688_end_0 = const()[name = tensor<string, []>("op_688_end_0"), val = tensor<int32, [4]>([1, 136, 1, 64])];
