program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3400.17.1"}, {"coremlc-version", "3400.17.1"}})]
{
    func main<ios16>(tensor<fp32, [1, 512]> attention_mask, tensor<fp32, [1, 512]> input_ids) {
            tensor<fp32, [30522, 128]> electra_embeddings_word_embeddings_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_embeddings_word_embeddings_weight_affine_quantized"), quantized_data = tensor<int8, [30522, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64))), scale = tensor<fp32, [30522]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3937536))), zero_point = tensor<int8, [30522]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3906944)))];
            tensor<fp32, [128]> electra_embeddings_LayerNorm_bias = const()[name = tensor<string, []>("electra_embeddings_LayerNorm_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4059712)))];
            tensor<fp32, [128]> electra_embeddings_LayerNorm_weight = const()[name = tensor<string, []>("electra_embeddings_LayerNorm_weight"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4060288)))];
            tensor<fp32, [256]> electra_embeddings_project_bias = const()[name = tensor<string, []>("electra_embeddings_project_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4060864)))];
            tensor<fp32, [256, 128]> electra_embeddings_project_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_embeddings_project_weight_affine_quantized"), quantized_data = tensor<int8, [256, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4061952))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4095104))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4094784)))];
            tensor<fp32, [256]> electra_encoder_layer_0_attention_self_query_bias = const()[name = tensor<string, []>("electra_encoder_layer_0_attention_self_query_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4096192)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_0_attention_self_query_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_0_attention_self_query_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4097280))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4163200))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4162880)))];
            tensor<fp32, [256]> electra_encoder_layer_0_attention_self_key_bias = const()[name = tensor<string, []>("electra_encoder_layer_0_attention_self_key_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4164288)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_0_attention_self_key_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_0_attention_self_key_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4165376))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4231296))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4230976)))];
            tensor<fp32, [256]> electra_encoder_layer_0_attention_self_value_bias = const()[name = tensor<string, []>("electra_encoder_layer_0_attention_self_value_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4232384)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_0_attention_self_value_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_0_attention_self_value_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4233472))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4299392))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4299072)))];
            tensor<fp32, [256]> electra_encoder_layer_0_attention_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_0_attention_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4300480)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_0_attention_output_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_0_attention_output_dense_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4301568))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4367488))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4367168)))];
            tensor<fp32, [256]> electra_encoder_layer_0_attention_output_LayerNorm_bias = const()[name = tensor<string, []>("electra_encoder_layer_0_attention_output_LayerNorm_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4368576)))];
            tensor<fp32, [256]> electra_encoder_layer_0_attention_output_LayerNorm_weight = const()[name = tensor<string, []>("electra_encoder_layer_0_attention_output_LayerNorm_weight"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4369664)))];
            tensor<fp32, [1024]> electra_encoder_layer_0_intermediate_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_0_intermediate_dense_bias"), val = tensor<fp32, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4370752)))];
            tensor<fp32, [1024, 256]> electra_encoder_layer_0_intermediate_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_0_intermediate_dense_weight_affine_quantized"), quantized_data = tensor<int8, [1024, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4374912))), scale = tensor<fp32, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4638208))), zero_point = tensor<int8, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4637120)))];
            tensor<fp32, [256]> electra_encoder_layer_0_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_0_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4642368)))];
            tensor<fp32, [256, 1024]> electra_encoder_layer_0_output_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_0_output_dense_weight_affine_quantized"), quantized_data = tensor<int8, [256, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4643456))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4905984))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4905664)))];
            tensor<fp32, [256]> electra_encoder_layer_0_output_LayerNorm_bias = const()[name = tensor<string, []>("electra_encoder_layer_0_output_LayerNorm_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4907072)))];
            tensor<fp32, [256]> electra_encoder_layer_0_output_LayerNorm_weight = const()[name = tensor<string, []>("electra_encoder_layer_0_output_LayerNorm_weight"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4908160)))];
            tensor<fp32, [256]> electra_encoder_layer_1_attention_self_query_bias = const()[name = tensor<string, []>("electra_encoder_layer_1_attention_self_query_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4909248)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_1_attention_self_query_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_1_attention_self_query_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4910336))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4976256))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4975936)))];
            tensor<fp32, [256]> electra_encoder_layer_1_attention_self_key_bias = const()[name = tensor<string, []>("electra_encoder_layer_1_attention_self_key_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4977344)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_1_attention_self_key_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_1_attention_self_key_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4978432))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5044352))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5044032)))];
            tensor<fp32, [256]> electra_encoder_layer_1_attention_self_value_bias = const()[name = tensor<string, []>("electra_encoder_layer_1_attention_self_value_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5045440)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_1_attention_self_value_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_1_attention_self_value_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5046528))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5112448))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5112128)))];
            tensor<fp32, [256]> electra_encoder_layer_1_attention_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_1_attention_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5113536)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_1_attention_output_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_1_attention_output_dense_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5114624))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5180544))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5180224)))];
            tensor<fp32, [256]> electra_encoder_layer_1_attention_output_LayerNorm_bias = const()[name = tensor<string, []>("electra_encoder_layer_1_attention_output_LayerNorm_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5181632)))];
            tensor<fp32, [256]> electra_encoder_layer_1_attention_output_LayerNorm_weight = const()[name = tensor<string, []>("electra_encoder_layer_1_attention_output_LayerNorm_weight"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5182720)))];
            tensor<fp32, [1024]> electra_encoder_layer_1_intermediate_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_1_intermediate_dense_bias"), val = tensor<fp32, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5183808)))];
            tensor<fp32, [1024, 256]> electra_encoder_layer_1_intermediate_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_1_intermediate_dense_weight_affine_quantized"), quantized_data = tensor<int8, [1024, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5187968))), scale = tensor<fp32, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5451264))), zero_point = tensor<int8, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5450176)))];
            tensor<fp32, [256]> electra_encoder_layer_1_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_1_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5455424)))];
            tensor<fp32, [256, 1024]> electra_encoder_layer_1_output_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_1_output_dense_weight_affine_quantized"), quantized_data = tensor<int8, [256, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5456512))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5719040))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5718720)))];
            tensor<fp32, [256]> electra_encoder_layer_1_output_LayerNorm_bias = const()[name = tensor<string, []>("electra_encoder_layer_1_output_LayerNorm_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5720128)))];
            tensor<fp32, [256]> electra_encoder_layer_1_output_LayerNorm_weight = const()[name = tensor<string, []>("electra_encoder_layer_1_output_LayerNorm_weight"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5721216)))];
            tensor<fp32, [256]> electra_encoder_layer_2_attention_self_query_bias = const()[name = tensor<string, []>("electra_encoder_layer_2_attention_self_query_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5722304)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_2_attention_self_query_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_2_attention_self_query_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5723392))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5789312))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5788992)))];
            tensor<fp32, [256]> electra_encoder_layer_2_attention_self_key_bias = const()[name = tensor<string, []>("electra_encoder_layer_2_attention_self_key_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5790400)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_2_attention_self_key_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_2_attention_self_key_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5791488))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5857408))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5857088)))];
            tensor<fp32, [256]> electra_encoder_layer_2_attention_self_value_bias = const()[name = tensor<string, []>("electra_encoder_layer_2_attention_self_value_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5858496)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_2_attention_self_value_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_2_attention_self_value_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5859584))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5925504))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5925184)))];
            tensor<fp32, [256]> electra_encoder_layer_2_attention_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_2_attention_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5926592)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_2_attention_output_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_2_attention_output_dense_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5927680))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5993600))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5993280)))];
            tensor<fp32, [256]> electra_encoder_layer_2_attention_output_LayerNorm_bias = const()[name = tensor<string, []>("electra_encoder_layer_2_attention_output_LayerNorm_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5994688)))];
            tensor<fp32, [256]> electra_encoder_layer_2_attention_output_LayerNorm_weight = const()[name = tensor<string, []>("electra_encoder_layer_2_attention_output_LayerNorm_weight"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5995776)))];
            tensor<fp32, [1024]> electra_encoder_layer_2_intermediate_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_2_intermediate_dense_bias"), val = tensor<fp32, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5996864)))];
            tensor<fp32, [1024, 256]> electra_encoder_layer_2_intermediate_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_2_intermediate_dense_weight_affine_quantized"), quantized_data = tensor<int8, [1024, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6001024))), scale = tensor<fp32, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6264320))), zero_point = tensor<int8, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6263232)))];
            tensor<fp32, [256]> electra_encoder_layer_2_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_2_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6268480)))];
            tensor<fp32, [256, 1024]> electra_encoder_layer_2_output_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_2_output_dense_weight_affine_quantized"), quantized_data = tensor<int8, [256, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6269568))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6532096))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6531776)))];
            tensor<fp32, [256]> electra_encoder_layer_2_output_LayerNorm_bias = const()[name = tensor<string, []>("electra_encoder_layer_2_output_LayerNorm_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6533184)))];
            tensor<fp32, [256]> electra_encoder_layer_2_output_LayerNorm_weight = const()[name = tensor<string, []>("electra_encoder_layer_2_output_LayerNorm_weight"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6534272)))];
            tensor<fp32, [256]> electra_encoder_layer_3_attention_self_query_bias = const()[name = tensor<string, []>("electra_encoder_layer_3_attention_self_query_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6535360)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_3_attention_self_query_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_3_attention_self_query_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6536448))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6602368))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6602048)))];
            tensor<fp32, [256]> electra_encoder_layer_3_attention_self_key_bias = const()[name = tensor<string, []>("electra_encoder_layer_3_attention_self_key_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6603456)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_3_attention_self_key_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_3_attention_self_key_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6604544))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6670464))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6670144)))];
            tensor<fp32, [256]> electra_encoder_layer_3_attention_self_value_bias = const()[name = tensor<string, []>("electra_encoder_layer_3_attention_self_value_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6671552)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_3_attention_self_value_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_3_attention_self_value_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6672640))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6738560))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6738240)))];
            tensor<fp32, [256]> electra_encoder_layer_3_attention_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_3_attention_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6739648)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_3_attention_output_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_3_attention_output_dense_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6740736))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6806656))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6806336)))];
            tensor<fp32, [256]> electra_encoder_layer_3_attention_output_LayerNorm_bias = const()[name = tensor<string, []>("electra_encoder_layer_3_attention_output_LayerNorm_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6807744)))];
            tensor<fp32, [256]> electra_encoder_layer_3_attention_output_LayerNorm_weight = const()[name = tensor<string, []>("electra_encoder_layer_3_attention_output_LayerNorm_weight"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6808832)))];
            tensor<fp32, [1024]> electra_encoder_layer_3_intermediate_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_3_intermediate_dense_bias"), val = tensor<fp32, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6809920)))];
            tensor<fp32, [1024, 256]> electra_encoder_layer_3_intermediate_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_3_intermediate_dense_weight_affine_quantized"), quantized_data = tensor<int8, [1024, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6814080))), scale = tensor<fp32, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7077376))), zero_point = tensor<int8, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7076288)))];
            tensor<fp32, [256]> electra_encoder_layer_3_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_3_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7081536)))];
            tensor<fp32, [256, 1024]> electra_encoder_layer_3_output_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_3_output_dense_weight_affine_quantized"), quantized_data = tensor<int8, [256, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7082624))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7345152))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7344832)))];
            tensor<fp32, [256]> electra_encoder_layer_3_output_LayerNorm_bias = const()[name = tensor<string, []>("electra_encoder_layer_3_output_LayerNorm_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7346240)))];
            tensor<fp32, [256]> electra_encoder_layer_3_output_LayerNorm_weight = const()[name = tensor<string, []>("electra_encoder_layer_3_output_LayerNorm_weight"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7347328)))];
            tensor<fp32, [256]> electra_encoder_layer_4_attention_self_query_bias = const()[name = tensor<string, []>("electra_encoder_layer_4_attention_self_query_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7348416)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_4_attention_self_query_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_4_attention_self_query_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7349504))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7415424))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7415104)))];
            tensor<fp32, [256]> electra_encoder_layer_4_attention_self_key_bias = const()[name = tensor<string, []>("electra_encoder_layer_4_attention_self_key_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7416512)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_4_attention_self_key_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_4_attention_self_key_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7417600))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7483520))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7483200)))];
            tensor<fp32, [256]> electra_encoder_layer_4_attention_self_value_bias = const()[name = tensor<string, []>("electra_encoder_layer_4_attention_self_value_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7484608)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_4_attention_self_value_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_4_attention_self_value_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7485696))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7551616))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7551296)))];
            tensor<fp32, [256]> electra_encoder_layer_4_attention_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_4_attention_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7552704)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_4_attention_output_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_4_attention_output_dense_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7553792))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7619712))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7619392)))];
            tensor<fp32, [256]> electra_encoder_layer_4_attention_output_LayerNorm_bias = const()[name = tensor<string, []>("electra_encoder_layer_4_attention_output_LayerNorm_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7620800)))];
            tensor<fp32, [256]> electra_encoder_layer_4_attention_output_LayerNorm_weight = const()[name = tensor<string, []>("electra_encoder_layer_4_attention_output_LayerNorm_weight"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7621888)))];
            tensor<fp32, [1024]> electra_encoder_layer_4_intermediate_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_4_intermediate_dense_bias"), val = tensor<fp32, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7622976)))];
            tensor<fp32, [1024, 256]> electra_encoder_layer_4_intermediate_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_4_intermediate_dense_weight_affine_quantized"), quantized_data = tensor<int8, [1024, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7627136))), scale = tensor<fp32, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7890432))), zero_point = tensor<int8, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7889344)))];
            tensor<fp32, [256]> electra_encoder_layer_4_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_4_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7894592)))];
            tensor<fp32, [256, 1024]> electra_encoder_layer_4_output_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_4_output_dense_weight_affine_quantized"), quantized_data = tensor<int8, [256, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7895680))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8158208))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8157888)))];
            tensor<fp32, [256]> electra_encoder_layer_4_output_LayerNorm_bias = const()[name = tensor<string, []>("electra_encoder_layer_4_output_LayerNorm_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8159296)))];
            tensor<fp32, [256]> electra_encoder_layer_4_output_LayerNorm_weight = const()[name = tensor<string, []>("electra_encoder_layer_4_output_LayerNorm_weight"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8160384)))];
            tensor<fp32, [256]> electra_encoder_layer_5_attention_self_query_bias = const()[name = tensor<string, []>("electra_encoder_layer_5_attention_self_query_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8161472)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_5_attention_self_query_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_5_attention_self_query_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8162560))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8228480))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8228160)))];
            tensor<fp32, [256]> electra_encoder_layer_5_attention_self_key_bias = const()[name = tensor<string, []>("electra_encoder_layer_5_attention_self_key_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8229568)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_5_attention_self_key_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_5_attention_self_key_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8230656))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8296576))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8296256)))];
            tensor<fp32, [256]> electra_encoder_layer_5_attention_self_value_bias = const()[name = tensor<string, []>("electra_encoder_layer_5_attention_self_value_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8297664)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_5_attention_self_value_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_5_attention_self_value_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8298752))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8364672))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8364352)))];
            tensor<fp32, [256]> electra_encoder_layer_5_attention_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_5_attention_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8365760)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_5_attention_output_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_5_attention_output_dense_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8366848))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8432768))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8432448)))];
            tensor<fp32, [256]> electra_encoder_layer_5_attention_output_LayerNorm_bias = const()[name = tensor<string, []>("electra_encoder_layer_5_attention_output_LayerNorm_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8433856)))];
            tensor<fp32, [256]> electra_encoder_layer_5_attention_output_LayerNorm_weight = const()[name = tensor<string, []>("electra_encoder_layer_5_attention_output_LayerNorm_weight"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8434944)))];
            tensor<fp32, [1024]> electra_encoder_layer_5_intermediate_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_5_intermediate_dense_bias"), val = tensor<fp32, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8436032)))];
            tensor<fp32, [1024, 256]> electra_encoder_layer_5_intermediate_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_5_intermediate_dense_weight_affine_quantized"), quantized_data = tensor<int8, [1024, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8440192))), scale = tensor<fp32, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8703488))), zero_point = tensor<int8, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8702400)))];
            tensor<fp32, [256]> electra_encoder_layer_5_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_5_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8707648)))];
            tensor<fp32, [256, 1024]> electra_encoder_layer_5_output_dense_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_5_output_dense_weight_affine_quantized"), quantized_data = tensor<int8, [256, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8708736))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8971264))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8970944)))];
            tensor<fp32, [256]> electra_encoder_layer_5_output_LayerNorm_bias = const()[name = tensor<string, []>("electra_encoder_layer_5_output_LayerNorm_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8972352)))];
            tensor<fp32, [256]> electra_encoder_layer_5_output_LayerNorm_weight = const()[name = tensor<string, []>("electra_encoder_layer_5_output_LayerNorm_weight"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8973440)))];
            tensor<fp32, [256]> electra_encoder_layer_6_attention_self_query_bias = const()[name = tensor<string, []>("electra_encoder_layer_6_attention_self_query_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8974528)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_6_attention_self_query_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_6_attention_self_query_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8975616))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9041536))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9041216)))];
            tensor<fp32, [256]> electra_encoder_layer_6_attention_self_key_bias = const()[name = tensor<string, []>("electra_encoder_layer_6_attention_self_key_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9042624)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_6_attention_self_key_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_6_attention_self_key_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9043712))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9109632))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9109312)))];
            tensor<fp32, [256]> electra_encoder_layer_6_attention_self_value_bias = const()[name = tensor<string, []>("electra_encoder_layer_6_attention_self_value_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9110720)))];
            tensor<fp32, [256, 256]> electra_encoder_layer_6_attention_self_value_weight_affine_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("electra_encoder_layer_6_attention_self_value_weight_affine_quantized"), quantized_data = tensor<int8, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9111808))), scale = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9177728))), zero_point = tensor<int8, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9177408)))];
            tensor<fp32, [256]> electra_encoder_layer_6_attention_output_dense_bias = const()[name = tensor<string, []>("electra_encoder_layer_6_attention_output_dense_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9178816)))];
